#Дан кортеж с числами. Определите, сколько в нем различных элементов.
korteg = (4,44,56,4,7,0,44,0,7,7,2,234,67,78,44,9,12,0,44,9,12,8)
lst=list()
for i in korteg:
    if i not in lst:
        lst.append(i)
print("Количество уникальных элементов в кортеже:",len(lst))
    