'''Написать программу, определяющую, сколько вариантов наборов из 5 цветков можно получить, учитывая,
что в магазине имеется 15 видов цветков и они не должны повторяться'''
from math import*
print(comb(15,5))