'''Напишите программу, преобразующую грудусную меру в радианную. Радианная угла - отношение длины дуги,
для которой данный угол является центральным, к радиусу окружности.'''

from math import*
print(radians(float(input("Введите градусную меру угла:"))))