'''Напишите программу для вычисления произведения 2 чисел без использования оператора "*".'''
from math import*
ochko = [2,3]
print(prod(ochko))